jmwilson/linear-clock-firmware/ublox-test.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G0
ProjectManager.MainLocation=Src
PA2.GPIO_PuPd=GPIO_NOPULL
RCC.USART1Freq_Value=64000000
TIM17.Prescaler=15
USART2.IPParameters=VirtualMode-Asynchronous,WordLength
RCC.CortexFreq_Value=64000000
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
I2C1.I2C_Speed_Mode=I2C_Fast
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G031K8Tx
PA3.GPIO_PuPd=GPIO_NOPULL
PA14-BOOT0.Mode=Serial_Wire
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_I2C1_Init-I2C1-false-HAL-true,4-MX_USART2_UART_Init-USART2-false-HAL-true,5-MX_TIM14_Init-TIM14-false-HAL-true,6-MX_TIM16_Init-TIM16-false-HAL-true,7-MX_TIM17_Init-TIM17-false-HAL-true
PA2.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC6.GPIO_Label=NUCLEO_LED
PA3.GPIOParameters=GPIO_ModeDefaultPP,GPIO_Speed,PinState,GPIO_PuPd
PA6.GPIO_Label=TLC592x_OE
RCC.USART2Freq_Value=16000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC15-OSC32_OUT\ (PC15).Mode=LSE-External-Oscillator
PA3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA2.GPIOParameters=GPIO_ModeDefaultPP,GPIO_Speed,PinState,GPIO_PuPd
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PC14-OSC32_IN\ (PC14).Mode=LSE-External-Oscillator
NVIC.I2C1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.LPTIM1Freq_Value=64000000
Mcu.IP4=TIM14
RCC.FCLKCortexFreq_Value=64000000
Mcu.IP5=TIM16
I2C1.IPParameters=Timing,I2C_Speed_Mode
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=I2C1
Mcu.IP1=NVIC
PA3.GPIO_ModeDefaultPP=GPIO_MODE_AF_PP
SH.S_TIM16_CH1.ConfNb=1
Mcu.UserConstants=
SH.S_TIM14_CH1.0=TIM14_CH1,PWM Generation1 CH1
Mcu.ThirdPartyNb=0
NVIC.TIM17_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.HCLKFreq_Value=64000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
Mcu.Pin6=PA6
Mcu.Pin7=PA7
TIM17.IPParameters=Prescaler,Period
Mcu.Pin8=PA9
Mcu.Pin9=PC6
RCC.AHBFreq_Value=64000000
Mcu.Pin0=PC14-OSC32_IN (PC14)
Mcu.Pin1=PC15-OSC32_OUT (PC15)
PA14-BOOT0.Signal=SYS_SWCLK
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA2
Mcu.Pin3=PA3
Mcu.Pin4=PA4
Mcu.Pin5=PA5
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
USART2.VirtualMode-Asynchronous=VM_ASYNC
TIM14.Period=999
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TIM16.OCPolarity_1=TIM_OCPOLARITY_LOW
TIM17.Period=999
ProjectManager.FirmwarePackage=STM32Cube FW_G0 V1.3.0
MxDb.Version=DB.5.0.60
PA2.PinState=GPIO_PIN_RESET
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=16000000
File.Version=6
RCC.PLLRCLKFreq_Value=64000000
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=ublox-test
RCC.TIM1Freq_Value=64000000
Mcu.Package=LQFP32
PA6.Signal=S_TIM16_CH1
RCC.TIM15Freq_Value=16000000
PA7.Locked=true
PA5.Locked=true
RCC.APBFreq_Value=64000000
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
PA10.Signal=I2C1_SDA
PC6.GPIO_PuPd=GPIO_NOPULL
PA5.GPIOParameters=GPIO_Label
USART2.WordLength=WORDLENGTH_8B
PC14-OSC32_IN\ (PC14).Locked=true
RCC.PLLPoutputFreq_Value=64000000
RCC.LPUART1Freq_Value=64000000
VP_TIM17_VS_OPM.Mode=OPM_bit
VP_TIM14_VS_ClockSourceINT.Mode=Enable_Timer
TIM16.Prescaler=64
TIM14.Pulse=500
TIM14.IPParameters=Channel,Prescaler,Period,Pulse,OCMode_PWM
PA4.GPIO_Label=TLC592x_CLK
PC6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
ProjectManager.CustomerFirmwarePackage=
PC6.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PA3.Signal=USART2_RX
PA2.Locked=true
PA6.GPIOParameters=GPIO_Label
NVIC.TIM14_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.PLLQoutputFreq_Value=64000000
ProjectManager.ProjectFileName=ublox-test.ioc
PA2.GPIO_ModeDefaultPP=GPIO_MODE_AF_PP
PA10.Mode=I2C
Mcu.PinsNb=18
VP_TIM14_VS_ClockSourceINT.Signal=TIM14_VS_ClockSourceINT
ProjectManager.NoMain=false
PC6.Signal=GPIO_Output
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
SH.S_TIM16_CH1.0=TIM16_CH1,PWM Generation1 CH1
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
NVIC.TIM16_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.DeletePrevious=true
boardIOC=true
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
TIM16.Channel=TIM_CHANNEL_1
RCC.FamilyName=M
PA13.Signal=SYS_SWDIO
PA3.Mode=Asynchronous
PA9.Mode=I2C
ProjectManager.TargetToolchain=Makefile
TIM14.OCMode_PWM=TIM_OCMODE_PWM2
PC6.Locked=true
PA9.Signal=I2C1_SCL
I2C1.Timing=0x00602173
RCC.I2S1Freq_Value=64000000
PC15-OSC32_OUT\ (PC15).Locked=true
SH.S_TIM14_CH1.ConfNb=1
PC6.PinState=GPIO_PIN_RESET
PA5.Signal=GPIO_Output
board=NUCLEO-G031K8
RCC.VCOOutputFreq_Value=128000000
ProjectManager.LastFirmware=true
TIM16.Period=99
TIM14.Channel=TIM_CHANNEL_1
MxCube.Version=5.6.1
RCC.I2C1Freq_Value=64000000
RCC.ADCFreq_Value=64000000
VP_SYS_VS_Systick.Mode=SysTick
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APBFreq_Value,APBTimFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2S1Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIM15Freq_Value,TIM1Freq_Value,USART1Freq_Value,USART2Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G031K(4-6-8)Tx
RCC.LPTIM2Freq_Value=64000000
PA14-BOOT0.Locked=true
TIM14.Prescaler=15
PA2.Signal=USART2_TX
ProjectManager.UnderRoot=false
Mcu.IP6=TIM17
Mcu.IP7=USART2
ProjectManager.CoupleFile=false
PA4.Signal=S_TIM14_CH1
RCC.APBTimFreq_Value=64000000
RCC.SYSCLKFreq_VALUE=64000000
PA7.GPIO_Label=TLC592x_SDO
PA3.Locked=true
VP_TIM17_VS_OPM.Signal=TIM17_VS_OPM
PA5.GPIO_Label=TLC592x_LE
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC14-OSC32_IN\ (PC14).Signal=RCC_OSC32_IN
PA13.Locked=true
ProjectManager.CompilerOptimize=6
ProjectManager.HeapSize=0x200
Mcu.Pin15=VP_TIM16_VS_ClockSourceINT
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_TIM17_VS_ClockSourceINT
Mcu.Pin13=VP_SYS_VS_Systick
PC6.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.Pin14=VP_TIM14_VS_ClockSourceINT
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_TIM17_VS_OPM
RCC.HSI_VALUE=16000000
Mcu.Pin11=PA13
Mcu.Pin12=PA14-BOOT0
Mcu.Pin10=PA10
TIM16.OCIdleState_1=TIM_OCIDLESTATE_RESET
PA2.Mode=Asynchronous
PA3.PinState=GPIO_PIN_RESET
RCC.PWRFreq_Value=64000000
TIM16.IPParameters=Channel,Prescaler,Period,OCPolarity_1,OCIdleState_1
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32G031K8Tx
ProjectManager.LibraryCopy=0
PA7.Signal=GPIO_Output
